# Be sure to preserve all special characters. These are preceded by a \ or % character or in <>.
[Translation]
Product Activation=Product Activation
Please enter your first name, last name, and where you bought the product=Please enter your first name, last name, and where you bought the product
Activation=Activation
Welcome! Please supply the information below to activate your product.=Welcome! Please supply the information below to activate your product.
Email=Email
Paste from clipboard=Paste from clipboard
Product Serial Number=Product Serial Number
Activate=Activate
Privacy policy=Privacy policy
The activation program could not communicate with the server.\r\rThis may be caused by a firewall blocking Internet access,\rplease check your settings and network permissions.\r\rWould you like to activate via another computer?=The activation program could not communicate with the server.\r\rThis may be caused by a firewall blocking Internet access,\rplease check your settings and network permissions.\r\rWould you like to activate via another computer?
The activation program could not download an activation response from the server=The activation program could not download an activation response from the server
Upload to Activate=Upload to Activate
Please upload %s\%s.txt using this form:\n%s\n\nYou will be given an activation file to be placed here:\n%s=Please upload %s\%s.txt using this form:\n%s\n\nYou will be given an activation file to be placed here:\n%s
Error activating the product: cannot read SID.=Error activating the product: cannot read SID.
Product Activation could not write the activation signature=Product Activation could not write the activation signature
Product successfully activated.\n\nAn activation signature has been stored in this location:\n\n%s\n\nIf you intend to uninstall %s, you can backup this file and restore it later to avoid further activations.=Product successfully activated.\n\nAn activation signature has been stored in this location:\n\n%s\n\nIf you intend to uninstall %s, you can backup this file and restore it later to avoid further activations.
Invalid product=Invalid product
Invalid key=Invalid key
No registration found=No registration found
Invalid registration=The serial number you have entered is invalid for “%s”. Please check the serial and try again.
Maximum activations reached=Maximum activations reached
Maximum activation requests from this IP address reached=Maximum activation requests from this IP address reached
Invalid request=Invalid request
Obsolete serial number - please request another from support=Obsolete serial number - please request another from support
Obsolete serial number - please download the lastest product version=Obsolete serial number - please download the lastest product version
The serial number is already registered to another account=The serial number is already registered to another account
Error activating the product=Error activating the product
The activation program could not activate the product=The activation program could not activate the product
Enter additional activation information=Enter additional activation information
The activation server needs other information to be sent for the activation to complete.=The activation server needs other information to be sent for the activation to complete.
First name=First name
Last name=Last name
Where did you buy the product?=Where did you buy the product?
Was this product was purchased directly from Stardock?=Was this product was purchased directly from Stardock?
OK=OK
Cancel=Cancel
Please ensure the serial number entered is associated with the email you used. Try to activate the product again. If using Impulse you can right-click on the product and re-activate. Include this log file if contacting support.=Please ensure the serial number entered is associated with the email you used and attempt to activate again. Include this log file if contacting support.
Please enter a valid email address.=Please enter a valid email address.
Network Activation Error=An error was detected with the network serial number you entered.\r\n\r\nYou appear to have entered a network serial number to activate a component of Object Desktop or ThinkDesk.\r\n\r\nThese serial numbers are of the form:\r\n\r\nOD-1234567-OEM-12345678 (length of the last section will vary)\r\nor\r\nTD-1234567-OEM-12345678\r\n\r\nYou can use the form at http://www.stardock.com/support to send your serial numbers if you have previously registered the product.
Product Activation Error=An error was detected with the product serial number you entered.\r\n\r\nSerial numbers are 35 characters in length, with hyphens, like this:\r\n\r\n11111-A3503-B2052-CAB32-DF0F3-AD325\r\n\r\nOlder serial numbers are 28 characters in length, like this:\r\n\r\n7CFC437D0B6260A613B8B77C228F\r\n\r\nYou can use the form at http://www.stardock.com/support to send your serial numbers if you have previously registered the product.
Old Product Activation Error=You appear to have entered a serial number for an old or unknown product.\r\n\r\nSince activation is now required, some serial numbers have c
Invalid Serial=Invalid serial number.
Loading...=Loading...
There was a problem with your installation.\n\nPlease reinstall and try again.=There was a problem with your installation.\n\nPlease reinstall and try again.
Downloading update...=Downloading update...
There was a problem while downloading the update.\n\nWould you like to retry?=There was a problem while downloading the update.\n\nWould you like to retry?
The download was canceled.\n\nPlease try again.=The download was canceled.\n\nPlease try again.
There was a problem while downloading the update.\n\nWould you like to be taken to a website for additional support?=There was a problem while downloading the update.\n\nWould you like to be taken to a website for additional support?
Cancel download?\n\nThe download must finish for you to use %s.=Cancel download?\n\nThe download must finish for you to use %s.
You do not appear to be connected to the internet.\n\nPlease verify your internet connection and try again.=You do not appear to be connected to the internet.\n\nPlease verify your internet connection and try again.
Upload to Activate=Upload to Activate
Please upload %s\\%s.txt using this form:\\n%s\\n\\nYou will be given an activation file to be placed here:\\n%s=Please upload %s\\%s.txt using this form:\\n%s\\n\\nYou will be given an activation file to be placed here:\\n%s
Success=Success
Error=Error
Stardock account email=Stardock account email
Serial number=Serial number
Stardock Account Registration=Stardock Account Registration
User name=Username
Password=Password
ReEnter password=Re-enter password
Create=Create
Login=Login
Quit=Quit
Register=Register
<a>Create Stardock account</a>=<a>Create Stardock account</a>
<a>Recover password</a>=<a>Reset password</a>
<a>Locate serial number</a>=<a>Locate serial number</a>
Reset Password=Reset password
No account found associated with e-mail %s, please create an account=No account found associated with email %s, please create an account.
Password entries do not match=Password entries do not match
An email has been sent to %s with information on resetting your Stardock account password=%s has been sent an email with a link to reset your Stardock account password.
Please enter a serial number for %s=Please enter a serial number for %s.
%s registration for %s was successful=%s registration for %s was successful!
%s is a required field. Please enter a valid value=%s is a required field. Please enter a valid value.
This serial number has been disabled for the given email account=This serial number has been disabled for the given email account.
Unhandled error %lu=Unhandled error %lu. Please contact support@stardock.com.
ResponseCode1=Missing arguments
ResponseCode2=Account not validated.  Please check your email including spam filters and trash for an email with the validation link.
ResponseCode5=Account with the given address not found. Please try another email or username.
ResponseCode6=Account does not exist.
ResponseCode7=Account already exists.  If you have forgotten your password, please click the Reset password link.
ResponseCode105=Nickname is already in use. Please choose another.
ResponseCode401=Username contains invalid characters.
ResponseCode402=Username is too long.
ResponseCode403=Username already exists.
ResponseCode5011=Account is not validated. Please check your email including spam filters and trash for an email with the validation link.
ResponseCode5012=Account does not exist.
Account associated with %s requires validation=Account associated with %s requires validation.
Account associated with %s has expired=Account associated with %s has expired.
Login with LoginID %s and password %s has failed. The information you have entered is not valid: either the account does not exist or the password is incorrect. Please check your login ID and password and try again, or click the Forgot Password? link to reset=Error: %s account may not exist or the password was entered incorrectly. Please check the information or click the Reset password link.
Login failed. There is no account with Login ID %s and password %s.  Please try again with another Login ID or password, or click the Forgot Password? link to reset=Error: %s account may not exist or the password was entered incorrectly. Please check the information or click the Reset password link.
Account associated with %s does not exist=Account associated with %s does not exist.
Account associated with %s already exists=Account associated with %s already exists. If you believe that this account is yours, please click the Reset password link.
Account with username %s already exists=Account with username %s already exists. If you believe that this account is yours, please click the Reset password link.
Username %s contains invalid characters=Username %s contains invalid characters.
Username %s is too long=Username %s is too long.
Stardock account successfully created.  Please enter your serial number on the next screen to register %s to your account=Stardock account successfully created.  Please enter your serial number on the next screen to register %s to your account.
SerialLookupLink=http://www.stardock.com/locateserial
CreateAccountLink=https://services.stardock.net/accounts/createaccount.aspx
Activate Internet Check Failed=NET001: Registration is unable to connect to the Internet to submit your information. Please check firewall/proxy settings and retry.\n\nIf you are still having problems, contact support@stardock.com with this error and your serial number/cd-key.
Create Account Internet Check Failed=NET002: Registration is unable to connect to the Internet to submit your information. Please check firewall/proxy settings and retry.\n\nIf you are still having problems, contact support@stardock.com with this error and your serial number/cd-key.
Request Failed=NET003: Registration is unable to connect to the Internet to submit your information. Please check firewall/proxy settings and retry.\n\nIf you are still having problems, contact support@stardock.com with this error and your serial number/cd-key.
Activation has failed and no license file has been written. Please contact support@stardock.com=Activation has failed and no license file has been written. Please contact support@stardock.com.
Failed to encrypt password. Aborting authentication=Failed to encrypt password. Aborting authentication. Please contact support@stardock.com.
Failed to encrypt password. Aborting account creation.=Failed to encrypt password. Aborting account creation. Please contact support@stardock.com.
Offline Activation=Offline activation
Offline Activation Msg=There was a problem attempting to submit your registration information. You can cancel and try again or attempt to use offline activation from the next window.